:PROPERTIES:
:ID:       ad3c5925-a485-4078-93e3-43d5e4a14d0a
:END:
#+hugo_base_dir:../
#+filetags: :programming:examples:
#+title: C++ Programming


* Basics
** Hello world
#+begin_src cpp -n :results output verbatim
#include <iostream>

int main(){
    std::cout << "Hello, world." << std::endl;
}
#+end_src

#+RESULTS:
: Hello, world.
* Templates
** Basic Template
#+begin_src cpp -n :results output verbatim
#include <iostream>

template<typename T>
T add_em_up(T& lhs, T& rhs){
    return lhs + rhs;
    }

int main(){

    int a{ 72 };
    int b{ 47 };
    std::cout << add_em_up<int>(a,b) << "\n";
}
#+end_src

#+RESULTS:
: 119
